#+TITLE: Projecteuler
* Problem 1: Multiples of 3 and 5
If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9.
The sum of these multiples is 23.
Find the sum of all the multiples of 3 or 5 below 1000.

#+begin_src emacs-lisp
(defun prob1 (max)
  (let (
        (out 0)
        (n 1))
    (while (< n max)
      (when (or (equal 0 (% n 3)) (equal 0 (% n 5)))
        (setq out (+ out n)))
      (setq n (+ n 1)))
    out ))

(prob1 1000)
#+end_src

#+RESULTS:
: 233168

* Problem 2: Even Fibonacci numbers
Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.

#+begin_src emacs-lisp
(defun prob2()
  (let (
        (out 2)
        (a 1)
        (b 2)
        (c 3))
        (while (< c 4000000)
          (when (equal 0 (% c 2))
              (setq out (+ out c)))
          (setq a b)
          (setq b c)
          (setq c (+ a b)))
        out))

(prob2)
#+end_src

#+RESULTS:
: 4613732

* Problem 3: Largest prime factor
The prime factors of 13195 are 5, 7, 13 and 29.
What is the largest prime factor of the number 600851475143?

#+begin_src emacs-lisp
(defun primefactors (n)
  (if (equal n 1)
    1
    2))

(primefactors 4)
#+end_src

#+RESULTS:
: 2

* Problem 5: Smallest multiple
2520 is the smallest number that can be divided by each of the numbers from 1 to 10 without any remainder.

What is the smallest positive number that is evenly divisible by all of the numbers from 1 to 20?

#+begin_src emacs-lisp
(defun divisiblebyrange (n r)
  "Is n divisible by all integers up until r?"
  (setq out 't)
  (dolist (i (number-sequence 2 r))
        (when (/= (mod n i) 0)
          (setq out 'nil)))
  out)

(defun prob5 (maxr)
  (setq out maxr)
  (while (eq (divisiblebyrange out maxr) 'nil)
    (setq out (+ out maxr)))
  out)

(prob5 10)
#+end_src

#+RESULTS:
: 100
